{"config": {"layers": [{"config": {"sparse": false, "name": "input_1", "batch_input_shape": [null, 40, 160, 3], "input_dtype": "float32"}, "name": "input_1", "class_name": "InputLayer", "inbound_nodes": []}, {"config": {"nb_row": 3, "activation": "relu", "border_mode": "same", "trainable": true, "nb_filter": 64, "name": "block1_conv1", "W_constraint": null, "init": "glorot_uniform", "dim_ordering": "tf", "subsample": [1, 1], "b_constraint": null, "bias": true, "b_regularizer": null, "nb_col": 3, "activity_regularizer": null, "W_regularizer": null}, "name": "block1_conv1", "class_name": "Convolution2D", "inbound_nodes": [[["input_1", 0, 0]]]}, {"config": {"nb_row": 3, "activation": "relu", "border_mode": "same", "trainable": true, "nb_filter": 64, "name": "block1_conv2", "W_constraint": null, "init": "glorot_uniform", "dim_ordering": "tf", "subsample": [1, 1], "b_constraint": null, "bias": true, "b_regularizer": null, "nb_col": 3, "activity_regularizer": null, "W_regularizer": null}, "name": "block1_conv2", "class_name": "Convolution2D", "inbound_nodes": [[["block1_conv1", 0, 0]]]}, {"config": {"strides": [2, 2], "border_mode": "valid", "trainable": true, "name": "block1_pool", "pool_size": [2, 2], "dim_ordering": "tf"}, "name": "block1_pool", "class_name": "MaxPooling2D", "inbound_nodes": [[["block1_conv2", 0, 0]]]}, {"config": {"nb_row": 3, "activation": "relu", "border_mode": "same", "trainable": true, "nb_filter": 128, "name": "block2_conv1", "W_constraint": null, "init": "glorot_uniform", "dim_ordering": "tf", "subsample": [1, 1], "b_constraint": null, "bias": true, "b_regularizer": null, "nb_col": 3, "activity_regularizer": null, "W_regularizer": null}, "name": "block2_conv1", "class_name": "Convolution2D", "inbound_nodes": [[["block1_pool", 0, 0]]]}, {"config": {"nb_row": 3, "activation": "relu", "border_mode": "same", "trainable": true, "nb_filter": 128, "name": "block2_conv2", "W_constraint": null, "init": "glorot_uniform", "dim_ordering": "tf", "subsample": [1, 1], "b_constraint": null, "bias": true, "b_regularizer": null, "nb_col": 3, "activity_regularizer": null, "W_regularizer": null}, "name": "block2_conv2", "class_name": "Convolution2D", "inbound_nodes": [[["block2_conv1", 0, 0]]]}, {"config": {"strides": [2, 2], "border_mode": "valid", "trainable": true, "name": "block2_pool", "pool_size": [2, 2], "dim_ordering": "tf"}, "name": "block2_pool", "class_name": "MaxPooling2D", "inbound_nodes": [[["block2_conv2", 0, 0]]]}, {"config": {"nb_row": 3, "activation": "relu", "border_mode": "same", "trainable": true, "nb_filter": 256, "name": "block3_conv1", "W_constraint": null, "init": "glorot_uniform", "dim_ordering": "tf", "subsample": [1, 1], "b_constraint": null, "bias": true, "b_regularizer": null, "nb_col": 3, "activity_regularizer": null, "W_regularizer": null}, "name": "block3_conv1", "class_name": "Convolution2D", "inbound_nodes": [[["block2_pool", 0, 0]]]}, {"config": {"nb_row": 3, "activation": "relu", "border_mode": "same", "trainable": true, "nb_filter": 256, "name": "block3_conv2", "W_constraint": null, "init": "glorot_uniform", "dim_ordering": "tf", "subsample": [1, 1], "b_constraint": null, "bias": true, "b_regularizer": null, "nb_col": 3, "activity_regularizer": null, "W_regularizer": null}, "name": "block3_conv2", "class_name": "Convolution2D", "inbound_nodes": [[["block3_conv1", 0, 0]]]}, {"config": {"nb_row": 3, "activation": "relu", "border_mode": "same", "trainable": true, "nb_filter": 256, "name": "block3_conv3", "W_constraint": null, "init": "glorot_uniform", "dim_ordering": "tf", "subsample": [1, 1], "b_constraint": null, "bias": true, "b_regularizer": null, "nb_col": 3, "activity_regularizer": null, "W_regularizer": null}, "name": "block3_conv3", "class_name": "Convolution2D", "inbound_nodes": [[["block3_conv2", 0, 0]]]}, {"config": {"strides": [2, 2], "border_mode": "valid", "trainable": true, "name": "block3_pool", "pool_size": [2, 2], "dim_ordering": "tf"}, "name": "block3_pool", "class_name": "MaxPooling2D", "inbound_nodes": [[["block3_conv3", 0, 0]]]}, {"config": {"nb_row": 3, "activation": "relu", "border_mode": "same", "trainable": true, "nb_filter": 512, "name": "block4_conv1", "W_constraint": null, "init": "glorot_uniform", "dim_ordering": "tf", "subsample": [1, 1], "b_constraint": null, "bias": true, "b_regularizer": null, "nb_col": 3, "activity_regularizer": null, "W_regularizer": null}, "name": "block4_conv1", "class_name": "Convolution2D", "inbound_nodes": [[["block3_pool", 0, 0]]]}, {"config": {"nb_row": 3, "activation": "relu", "border_mode": "same", "trainable": true, "nb_filter": 512, "name": "block4_conv2", "W_constraint": null, "init": "glorot_uniform", "dim_ordering": "tf", "subsample": [1, 1], "b_constraint": null, "bias": true, "b_regularizer": null, "nb_col": 3, "activity_regularizer": null, "W_regularizer": null}, "name": "block4_conv2", "class_name": "Convolution2D", "inbound_nodes": [[["block4_conv1", 0, 0]]]}, {"config": {"nb_row": 3, "activation": "relu", "border_mode": "same", "trainable": true, "nb_filter": 512, "name": "block4_conv3", "W_constraint": null, "init": "glorot_uniform", "dim_ordering": "tf", "subsample": [1, 1], "b_constraint": null, "bias": true, "b_regularizer": null, "nb_col": 3, "activity_regularizer": null, "W_regularizer": null}, "name": "block4_conv3", "class_name": "Convolution2D", "inbound_nodes": [[["block4_conv2", 0, 0]]]}, {"config": {"strides": [2, 2], "border_mode": "valid", "trainable": true, "name": "block4_pool", "pool_size": [2, 2], "dim_ordering": "tf"}, "name": "block4_pool", "class_name": "MaxPooling2D", "inbound_nodes": [[["block4_conv3", 0, 0]]]}, {"config": {"nb_row": 3, "activation": "relu", "border_mode": "same", "trainable": true, "nb_filter": 512, "name": "block5_conv1", "W_constraint": null, "init": "glorot_uniform", "dim_ordering": "tf", "subsample": [1, 1], "b_constraint": null, "bias": true, "b_regularizer": null, "nb_col": 3, "activity_regularizer": null, "W_regularizer": null}, "name": "block5_conv1", "class_name": "Convolution2D", "inbound_nodes": [[["block4_pool", 0, 0]]]}, {"config": {"nb_row": 3, "activation": "relu", "border_mode": "same", "trainable": true, "nb_filter": 512, "name": "block5_conv2", "W_constraint": null, "init": "glorot_uniform", "dim_ordering": "tf", "subsample": [1, 1], "b_constraint": null, "bias": true, "b_regularizer": null, "nb_col": 3, "activity_regularizer": null, "W_regularizer": null}, "name": "block5_conv2", "class_name": "Convolution2D", "inbound_nodes": [[["block5_conv1", 0, 0]]]}, {"config": {"nb_row": 3, "activation": "relu", "border_mode": "same", "trainable": true, "nb_filter": 512, "name": "block5_conv3", "W_constraint": null, "init": "glorot_uniform", "dim_ordering": "tf", "subsample": [1, 1], "b_constraint": null, "bias": true, "b_regularizer": null, "nb_col": 3, "activity_regularizer": null, "W_regularizer": null}, "name": "block5_conv3", "class_name": "Convolution2D", "inbound_nodes": [[["block5_conv2", 0, 0]]]}, {"config": {"strides": [2, 2], "border_mode": "valid", "trainable": true, "name": "block5_pool", "pool_size": [2, 2], "dim_ordering": "tf"}, "name": "block5_pool", "class_name": "MaxPooling2D", "inbound_nodes": [[["block5_conv3", 0, 0]]]}, {"config": {"name": "flatten_1", "trainable": true}, "name": "flatten_1", "class_name": "Flatten", "inbound_nodes": [[["block5_pool", 0, 0]]]}, {"config": {"activation": "relu", "output_dim": 1024, "trainable": true, "name": "fc", "W_constraint": null, "init": "glorot_uniform", "b_constraint": null, "bias": true, "b_regularizer": null, "activity_regularizer": null, "input_dim": 2560, "W_regularizer": null}, "name": "fc", "class_name": "Dense", "inbound_nodes": [[["flatten_1", 0, 0]]]}, {"config": {"activation": "linear", "output_dim": 1, "trainable": true, "name": "predictions", "W_constraint": null, "init": "glorot_uniform", "b_constraint": null, "bias": true, "b_regularizer": null, "activity_regularizer": null, "input_dim": 1024, "W_regularizer": null}, "name": "predictions", "class_name": "Dense", "inbound_nodes": [[["fc", 0, 0]]]}], "name": "model_1", "input_layers": [["input_1", 0, 0]], "output_layers": [["predictions", 0, 0]]}, "keras_version": "1.2.1", "class_name": "Model"}