{"keras_version": "1.2.1", "config": {"layers": [{"config": {"batch_input_shape": [null, 40, 160, 3], "input_dtype": "float32", "sparse": false, "name": "input_1"}, "inbound_nodes": [], "class_name": "InputLayer", "name": "input_1"}, {"config": {"dim_ordering": "tf", "W_regularizer": null, "nb_filter": 64, "activation": "relu", "init": "glorot_uniform", "name": "block1_conv1", "nb_col": 3, "subsample": [1, 1], "W_constraint": null, "b_regularizer": null, "activity_regularizer": null, "b_constraint": null, "border_mode": "same", "nb_row": 3, "bias": true, "trainable": true}, "inbound_nodes": [[["input_1", 0, 0]]], "class_name": "Convolution2D", "name": "block1_conv1"}, {"config": {"dim_ordering": "tf", "W_regularizer": null, "nb_filter": 64, "activation": "relu", "init": "glorot_uniform", "name": "block1_conv2", "nb_col": 3, "subsample": [1, 1], "W_constraint": null, "b_regularizer": null, "activity_regularizer": null, "b_constraint": null, "border_mode": "same", "nb_row": 3, "bias": true, "trainable": true}, "inbound_nodes": [[["block1_conv1", 0, 0]]], "class_name": "Convolution2D", "name": "block1_conv2"}, {"config": {"dim_ordering": "tf", "border_mode": "valid", "trainable": true, "strides": [2, 2], "name": "block1_pool", "pool_size": [2, 2]}, "inbound_nodes": [[["block1_conv2", 0, 0]]], "class_name": "MaxPooling2D", "name": "block1_pool"}, {"config": {"dim_ordering": "tf", "W_regularizer": null, "nb_filter": 128, "activation": "relu", "init": "glorot_uniform", "name": "block2_conv1", "nb_col": 3, "subsample": [1, 1], "W_constraint": null, "b_regularizer": null, "activity_regularizer": null, "b_constraint": null, "border_mode": "same", "nb_row": 3, "bias": true, "trainable": true}, "inbound_nodes": [[["block1_pool", 0, 0]]], "class_name": "Convolution2D", "name": "block2_conv1"}, {"config": {"dim_ordering": "tf", "W_regularizer": null, "nb_filter": 128, "activation": "relu", "init": "glorot_uniform", "name": "block2_conv2", "nb_col": 3, "subsample": [1, 1], "W_constraint": null, "b_regularizer": null, "activity_regularizer": null, "b_constraint": null, "border_mode": "same", "nb_row": 3, "bias": true, "trainable": true}, "inbound_nodes": [[["block2_conv1", 0, 0]]], "class_name": "Convolution2D", "name": "block2_conv2"}, {"config": {"dim_ordering": "tf", "border_mode": "valid", "trainable": true, "strides": [2, 2], "name": "block2_pool", "pool_size": [2, 2]}, "inbound_nodes": [[["block2_conv2", 0, 0]]], "class_name": "MaxPooling2D", "name": "block2_pool"}, {"config": {"dim_ordering": "tf", "W_regularizer": null, "nb_filter": 256, "activation": "relu", "init": "glorot_uniform", "name": "block3_conv1", "nb_col": 3, "subsample": [1, 1], "W_constraint": null, "b_regularizer": null, "activity_regularizer": null, "b_constraint": null, "border_mode": "same", "nb_row": 3, "bias": true, "trainable": true}, "inbound_nodes": [[["block2_pool", 0, 0]]], "class_name": "Convolution2D", "name": "block3_conv1"}, {"config": {"dim_ordering": "tf", "W_regularizer": null, "nb_filter": 256, "activation": "relu", "init": "glorot_uniform", "name": "block3_conv2", "nb_col": 3, "subsample": [1, 1], "W_constraint": null, "b_regularizer": null, "activity_regularizer": null, "b_constraint": null, "border_mode": "same", "nb_row": 3, "bias": true, "trainable": true}, "inbound_nodes": [[["block3_conv1", 0, 0]]], "class_name": "Convolution2D", "name": "block3_conv2"}, {"config": {"dim_ordering": "tf", "W_regularizer": null, "nb_filter": 256, "activation": "relu", "init": "glorot_uniform", "name": "block3_conv3", "nb_col": 3, "subsample": [1, 1], "W_constraint": null, "b_regularizer": null, "activity_regularizer": null, "b_constraint": null, "border_mode": "same", "nb_row": 3, "bias": true, "trainable": true}, "inbound_nodes": [[["block3_conv2", 0, 0]]], "class_name": "Convolution2D", "name": "block3_conv3"}, {"config": {"dim_ordering": "tf", "border_mode": "valid", "trainable": true, "strides": [2, 2], "name": "block3_pool", "pool_size": [2, 2]}, "inbound_nodes": [[["block3_conv3", 0, 0]]], "class_name": "MaxPooling2D", "name": "block3_pool"}, {"config": {"dim_ordering": "tf", "W_regularizer": null, "nb_filter": 512, "activation": "relu", "init": "glorot_uniform", "name": "block4_conv1", "nb_col": 3, "subsample": [1, 1], "W_constraint": null, "b_regularizer": null, "activity_regularizer": null, "b_constraint": null, "border_mode": "same", "nb_row": 3, "bias": true, "trainable": true}, "inbound_nodes": [[["block3_pool", 0, 0]]], "class_name": "Convolution2D", "name": "block4_conv1"}, {"config": {"dim_ordering": "tf", "W_regularizer": null, "nb_filter": 512, "activation": "relu", "init": "glorot_uniform", "name": "block4_conv2", "nb_col": 3, "subsample": [1, 1], "W_constraint": null, "b_regularizer": null, "activity_regularizer": null, "b_constraint": null, "border_mode": "same", "nb_row": 3, "bias": true, "trainable": true}, "inbound_nodes": [[["block4_conv1", 0, 0]]], "class_name": "Convolution2D", "name": "block4_conv2"}, {"config": {"dim_ordering": "tf", "W_regularizer": null, "nb_filter": 512, "activation": "relu", "init": "glorot_uniform", "name": "block4_conv3", "nb_col": 3, "subsample": [1, 1], "W_constraint": null, "b_regularizer": null, "activity_regularizer": null, "b_constraint": null, "border_mode": "same", "nb_row": 3, "bias": true, "trainable": true}, "inbound_nodes": [[["block4_conv2", 0, 0]]], "class_name": "Convolution2D", "name": "block4_conv3"}, {"config": {"dim_ordering": "tf", "border_mode": "valid", "trainable": true, "strides": [2, 2], "name": "block4_pool", "pool_size": [2, 2]}, "inbound_nodes": [[["block4_conv3", 0, 0]]], "class_name": "MaxPooling2D", "name": "block4_pool"}, {"config": {"dim_ordering": "tf", "W_regularizer": null, "nb_filter": 512, "activation": "relu", "init": "glorot_uniform", "name": "block5_conv1", "nb_col": 3, "subsample": [1, 1], "W_constraint": null, "b_regularizer": null, "activity_regularizer": null, "b_constraint": null, "border_mode": "same", "nb_row": 3, "bias": true, "trainable": true}, "inbound_nodes": [[["block4_pool", 0, 0]]], "class_name": "Convolution2D", "name": "block5_conv1"}, {"config": {"dim_ordering": "tf", "W_regularizer": null, "nb_filter": 512, "activation": "relu", "init": "glorot_uniform", "name": "block5_conv2", "nb_col": 3, "subsample": [1, 1], "W_constraint": null, "b_regularizer": null, "activity_regularizer": null, "b_constraint": null, "border_mode": "same", "nb_row": 3, "bias": true, "trainable": true}, "inbound_nodes": [[["block5_conv1", 0, 0]]], "class_name": "Convolution2D", "name": "block5_conv2"}, {"config": {"dim_ordering": "tf", "W_regularizer": null, "nb_filter": 512, "activation": "relu", "init": "glorot_uniform", "name": "block5_conv3", "nb_col": 3, "subsample": [1, 1], "W_constraint": null, "b_regularizer": null, "activity_regularizer": null, "b_constraint": null, "border_mode": "same", "nb_row": 3, "bias": true, "trainable": true}, "inbound_nodes": [[["block5_conv2", 0, 0]]], "class_name": "Convolution2D", "name": "block5_conv3"}, {"config": {"dim_ordering": "tf", "border_mode": "valid", "trainable": true, "strides": [2, 2], "name": "block5_pool", "pool_size": [2, 2]}, "inbound_nodes": [[["block5_conv3", 0, 0]]], "class_name": "MaxPooling2D", "name": "block5_pool"}, {"config": {"name": "flatten_1", "trainable": true}, "inbound_nodes": [[["block5_pool", 0, 0]]], "class_name": "Flatten", "name": "flatten_1"}, {"config": {"b_regularizer": null, "W_regularizer": null, "activation": "relu", "init": "glorot_uniform", "name": "fc", "b_constraint": null, "output_dim": 1024, "W_constraint": null, "activity_regularizer": null, "input_dim": 2560, "bias": true, "trainable": true}, "inbound_nodes": [[["flatten_1", 0, 0]]], "class_name": "Dense", "name": "fc"}, {"config": {"b_regularizer": null, "W_regularizer": null, "activation": "linear", "init": "glorot_uniform", "name": "fc2", "b_constraint": null, "output_dim": 2, "W_constraint": null, "activity_regularizer": null, "input_dim": 1024, "bias": true, "trainable": true}, "inbound_nodes": [[["fc", 0, 0]]], "class_name": "Dense", "name": "fc2"}, {"config": {"b_regularizer": null, "W_regularizer": null, "activation": "linear", "init": "glorot_uniform", "name": "predictions", "b_constraint": null, "output_dim": 1, "W_constraint": null, "activity_regularizer": null, "input_dim": 2, "bias": true, "trainable": true}, "inbound_nodes": [[["fc2", 0, 0]]], "class_name": "Dense", "name": "predictions"}], "input_layers": [["input_1", 0, 0]], "name": "model_1", "output_layers": [["predictions", 0, 0]]}, "class_name": "Model"}